OpenFOAM-v2412/tutorials/incompressible/pimpleFoam/LES/wallMountedHump/setups.orig/common/system/wallFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

wallShearStress
{
    type            wallShearStress;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeFields     yes;
    writeControl    writeTime;

    patches         ( bottomWall );
}

yPlus
{
    type            yPlus;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeFields     yes;
    writeControl    writeTime;
}


// ************************************************************************* //
